Revit 2024 API
StairsLanding.GetAllSupports Method
 Returns all the supports hosting the stairs landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IList<ElementId> GetAllSupports()
Visual Basic
Public Function GetAllSupports As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetAllSupports()
Return Value
 All the supports hosting the stairs landings.
Remarks
 The supports consist of left, right and middle supports of the stairs landing.
See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace